st-one/X-CUBE-USB-PD/STM32CubeExpansion_USBPD_F0/Projects/STM32F072RB-Nucleo/Applications/USB_PD/Consumer_CLI_RTOS/Src/usbpd_dpm.c
  /* Check type of information targeted by request */
  switch (DataId)
  {
    /* Case Port Source PDO Data information :
       Case Port SINK PDO Data information :
         Call PWR_IF PDO reading request.
    */
    case USBPD_CORE_DATATYPE_SRC_PDO :
    case USBPD_CORE_DATATYPE_SNK_PDO :
      USBPD_PWR_IF_GetPortPDOs(PortNum, DataId, Ptr, Size);
      break;

    /* Case Port Received Source PDO Data information (from distant port) */
    case USBPD_CORE_DATATYPE_RCV_SRC_PDO : 
      for(index = 0; index < DPM_Ports[PortNum].DPM_NumberOfRcvSRCPDO; index++)
      {
        *(uint32_t*)(Ptr + index) = DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[index];
      }
      *Size = DPM_Ports[PortNum].DPM_NumberOfRcvSRCPDO;
      break;

    /* Case Port Received Sink PDO Data information (from distant port) */
    case USBPD_CORE_DATATYPE_RCV_SNK_PDO :
      for(index = 0; index < DPM_Ports[PortNum].DPM_NumberOfRcvSNKPDO; index++)
      {
        *(uint32_t*)(Ptr + index) = DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index];
      }
      *Size = DPM_Ports[PortNum].DPM_NumberOfRcvSRCPDO;
      break;

    /* Case Requested voltage value Data information */
    case USBPD_CORE_DATATYPE_REQ_VOLTAGE :
      *Ptr = DPM_Ports[PortNum].DPM_RequestedVoltage;
      *Size = 1;
      break;

    /* Case Request message DO (from Sink to Source) Data information */
    case USBPD_CORE_DATATYPE_REQUEST_DO :
      *Ptr = DPM_Ports[PortNum].DPM_RequestDOMsg;
      *Size = 1;
      break;

    /* In case of unexpected data type (reading request could not be fulfilled) :
       Set nb of read u32 to 0.
    */
    default :
      *Size = 0;
      break;
  }
}

/**
  * @brief  DPM callback to allow PE to update information in DPM/PWR_IF.
  * @param  PortNum Port number
  * @param  DataId Type of data to be updated in DPM
  *         This parameter can be one of the following values:
  *           @arg @ref USBPD_CORE_DATATYPE_RDO_POSITION Storage of requested DO position in PDO list
  *           @arg @ref USBPD_CORE_DATATYPE_REQ_VOLTAGE Storage of requested voltage value
  *           @arg @ref USBPD_CORE_DATATYPE_RCV_SRC_PDO Storage of Received Source PDO values 
  *           @arg @ref USBPD_CORE_DATATYPE_RCV_SNK_PDO Storage of Received Sink PDO values
  *           @arg @ref USBPD_CORE_DATATYPE_RCV_REQ_PDO Storage of Received Sink Request PDO value
  *           @arg @ref USBPD_CORE_DATATYPE_REQUEST_DO  Storage of Request message DO (from Sink to Source)
  * @param  Ptr Pointer on address where DPM data to be updated could be read (u32 pointer)
  * @param  Size nb of u32 to be updated in DPM
  * @note   In case of USBPD_CORE_DATATYPE_RDO_POSITION or USBPD_CORE_DATATYPE_REQ_VOLTAGE 
  *         data information types, Size value is expected to be equal to 1.
  * @retval None
  */
static void USBPD_DPM_SetDataInfo(uint8_t PortNum, USBPD_CORE_DataInfoType_TypeDef DataId, uint32_t *Ptr, uint32_t Size)
{
  uint32_t index;

  /* Check type of information targeted by request */
  switch (DataId)
  {
    /* Case requested DO position Data information :
    */
    case USBPD_CORE_DATATYPE_RDO_POSITION :
      if (Size == 1)
      {
        DPM_Ports[PortNum].DPM_RDOPosition = *Ptr;
      }
      break;

    /* Case requested Voltage Data information :
    */
    case USBPD_CORE_DATATYPE_REQ_VOLTAGE :
      if (Size == 1)
      {
        DPM_Ports[PortNum].DPM_RequestedVoltage = *Ptr;
      }
      break;

    /* Case Received Source PDO values Data information :
    */
    case USBPD_CORE_DATATYPE_RCV_SRC_PDO : 
      if (Size <= USBPD_MAX_NB_PDO)
      {
        DPM_Ports[PortNum].DPM_NumberOfRcvSRCPDO = Size;
        /* Copy PDO data in DPM Handle field */
        for (index = 0; index < Size; index++)
        {
          DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[index] = LE32(Ptr + index);
        }
      }
      break;

    /* Case Received Sink PDO values Data information :
    */
    case USBPD_CORE_DATATYPE_RCV_SNK_PDO :
      if (Size <= USBPD_MAX_NB_PDO)
      {
        DPM_Ports[PortNum].DPM_NumberOfRcvSNKPDO = Size;
        /* Copy PDO data in DPM Handle field */
        for (index = 0; index < Size; index++)
        {
          DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index] = LE32(Ptr + index);
        }
      }
      break;

    /* Case Received Request PDO Data information :
    */
    case USBPD_CORE_DATATYPE_RCV_REQ_PDO :
      if (Size == 1)
      {
        DPM_Ports[PortNum].DPM_RcvRequestDOMsg = *Ptr;
      }
      break;

    /* Case RRequest message DO (from Sink to Source) Data information :
    */
    case USBPD_CORE_DATATYPE_REQUEST_DO :
      if (Size == 1)
      {
        DPM_Ports[PortNum].DPM_RcvRequestDOMsg = *Ptr;
      }
      break;

    /* In case of unexpected data type (Set request could not be fulfilled) :
    */
    default :
      break;
  }
}

/**
  * @brief  Evaluate received Request Message from Sink port  
  * @param  pdhandle Pointer to USB PD handle
  * @retval USBPD status
  */
static USBPD_StatusTypeDef USBPD_DPM_EvaluateRequest(uint8_t PortNum)
{
  uint32_t rdo = 0, pdo = 0, pdomaxcurrent = 0;
  uint32_t rdomaxcurrent = 0, rdoopcurrent = 0, rdoobjposition = 0;
  USBPD_HandleTypeDef *pdhandle = &DPM_Ports[PortNum];

  rdo = pdhandle->DPM_RcvRequestDOMsg;
  rdomaxcurrent = rdo & 0x3FF;
  rdoopcurrent = (rdo >> 10) & 0x3FF;
  rdoobjposition = (rdo >> 28) & 0x7;
  pdhandle->DPM_RDOPosition = 0;
  
  /* Check if RDP can be met within the supported PDOs by the Source port */
  USBPD_UsrLog("USBPD_DPM_EvaluateRequest: Evaluate Sink Request\r");
  USBPD_UsrLog("USBPD_DPM_EvaluateRequest: Check if RDP can be met within the supported PDOs by the Source port\r");
  
  /* Search PDO in Port Source PDO list, that corresponds to Position provided in Request RDO */
  if (USBPD_PWR_IF_SearchRequestedPDO(PortNum, rdoobjposition, &pdo) != USBPD_OK)
  {
    /* Invalid PDO index */
    USBPD_ErrLog("USBPD_DPM_EvaluateRequest: Invalid PDOs index\r");
    return USBPD_FAIL;
  }

  pdomaxcurrent = (pdo & 0x3FF);
  
  if(rdoopcurrent > pdomaxcurrent)
  {
    /* Sink requests too much operating current */
    USBPD_ErrLog("USBPD_DPM_EvaluateRequest: Sink requests too much operating current\r");
    return USBPD_FAIL;
  }

  if(rdomaxcurrent > pdomaxcurrent)
  {
    /* Sink requests too much maximum operating current */
    USBPD_ErrLog("USBPD_DPM_EvaluateRequest: Sink requests too much maximum operating current\r");
    return USBPD_FAIL;
  }

  /* Set RDO position and requested voltage in DPM port structure */
  pdhandle->DPM_RequestedVoltage = ((pdo >> 10) & 0x3ff) * 50;
  pdhandle->DPM_RDOPosition = rdoobjposition;

  /* Accept the requested power */
  USBPD_UsrLog("USBPD_DPM_EvaluateRequest: Sink requested %d mV %d mA for operating current from %d to %d mA\r",
               ((pdo >> 10) & 0x3ff) * 50, (pdo & 0x3ff) * 10,
               ((rdo >> 10) & 0x3ff) * 10, (rdo & 0x3ff) * 10);
  USBPD_UsrLog("USBPD_DPM_EvaluateRequest: Source accepts the requested power\r");

  return USBPD_OK;
}


/**
  * @brief  Evaluate received Capabilities Message from Source port and prepare the request message  
  * @param  PortNum Port number
  * @retval USBPD status
  */
static USBPD_StatusTypeDef USBPD_DPM_EvaluateCapabilities(uint8_t PortNum)
{
  uint32_t mv = 0, mw = 0, ma = 0, pdo;
  USBPD_SNKBatteryRDO_TypeDef rdpbattery;
  USBPD_SNKFixedVariableRDO_TypeDef rdpfixed;
  USBPD_HandleTypeDef *pdhandle = &DPM_Ports[PortNum];
  int32_t pdoindex = 0;
  
